class Assistant:
    def __init__(self, name):
        self.name = name

    def greet(self):

        print("""
███╗   ██╗███████╗██╗  ██╗ █████╗
████╗  ██║██╔════╝╚██╗██╔╝██╔══██╗
██╔██╗ ██║█████╗   ╚███╔╝ ███████║
██║╚██╗██║██╔══╝   ██╔██╗ ██╔══██║
██║ ╚████║███████╗██╔╝ ██╗██║  ██║
╚═╝  ╚═══╝╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝
        """)

        print("=" * 55)
        print(f" Welcome to {self.name}")
        print(" Local AI Desktop Assistant")
        print("=" * 55)

    def listen(self):
        command = input(f"{self.name} > ")
        return command.lower()